In [1]:
import numpy as np
import pandas as pd

In [2]:
frame1 = pd.DataFrame( {'id':['ball','pencil','pen','mug','ashtray'],
                      'price': [12.33,11.44,33.21,13.23,33.62]})
frame1

        id  price
0     ball  12.33
1   pencil  11.44
2      pen  33.21
3      mug  13.23
4  ashtray  33.62

In [4]:
frame2 = pd.DataFrame( {'id':['pencil','pencil','ball','pen'],
                      'color': ['white','red','red','black']})
frame2

       id  color
0  pencil  white
1  pencil    red
2    ball    red
3     pen  black

In [5]:
#Merging,corresponds to the JOIN operation for those who are familiar with SQL
pd.merge(frame1,frame2)

       id  price  color
0    ball  12.33    red
1  pencil  11.44  white
2  pencil  11.44    red
3     pen  33.21  black

In [7]:
frame1 = pd.DataFrame(np.random.rand(9).reshape(3,3), index=[1,2,3], columns=['A','B','C'])
frame1

          A         B         C
1  0.074354  0.655049  0.008204
2  0.992624  0.932550  0.239121
3  0.112529  0.934465  0.279150

In [8]:
frame2 = pd.DataFrame(np.random.rand(9).reshape(3,3), index=[4,5,6], columns=['A','B','C'])
frame2

          A         B         C
4  0.779247  0.739954  0.397264
5  0.383051  0.643009  0.283001
6  0.455292  0.601368  0.151403

In [9]:
#Concatenating
pd.concat([frame1, frame2])

          A         B         C
1  0.074354  0.655049  0.008204
2  0.992624  0.932550  0.239121
3  0.112529  0.934465  0.279150
4  0.779247  0.739954  0.397264
5  0.383051  0.643009  0.283001
6  0.455292  0.601368  0.151403

In [10]:
pd.concat([frame1, frame2], axis=1)

          A         B         C         A         B         C
1  0.074354  0.655049  0.008204       NaN       NaN       NaN
2  0.992624  0.932550  0.239121       NaN       NaN       NaN
3  0.112529  0.934465  0.279150       NaN       NaN       NaN
4       NaN       NaN       NaN  0.779247  0.739954  0.397264
5       NaN       NaN       NaN  0.383051  0.643009  0.283001
6       NaN       NaN       NaN  0.455292  0.601368  0.151403

In [11]:
frame3=pd.concat([frame1, frame2], axis=1)
frame3

          A         B         C         A         B         C
1  0.074354  0.655049  0.008204       NaN       NaN       NaN
2  0.992624  0.932550  0.239121       NaN       NaN       NaN
3  0.112529  0.934465  0.279150       NaN       NaN       NaN
4       NaN       NaN       NaN  0.779247  0.739954  0.397264
5       NaN       NaN       NaN  0.383051  0.643009  0.283001
6       NaN       NaN       NaN  0.455292  0.601368  0.151403

In [12]:
frame3

          A         B         C         A         B         C
1  0.074354  0.655049  0.008204       NaN       NaN       NaN
2  0.992624  0.932550  0.239121       NaN       NaN       NaN
3  0.112529  0.934465  0.279150       NaN       NaN       NaN
4       NaN       NaN       NaN  0.779247  0.739954  0.397264
5       NaN       NaN       NaN  0.383051  0.643009  0.283001
6       NaN       NaN       NaN  0.455292  0.601368  0.151403

In [13]:
#delete a column from a dataframe
del frame3['A']

In [14]:
frame3

          B         C         B         C
1  0.655049  0.008204       NaN       NaN
2  0.932550  0.239121       NaN       NaN
3  0.934465  0.279150       NaN       NaN
4       NaN       NaN  0.739954  0.397264
5       NaN       NaN  0.643009  0.283001
6       NaN       NaN  0.601368  0.151403

In [16]:
frame3.mean()

B    0.840688
C    0.175492
B    0.661444
C    0.277223
dtype: float64

In [17]:
frame3.replace(np.nan,frame3.mean())

          B         C         B         C
1  0.655049  0.008204  0.661444  0.277223
2  0.932550  0.239121  0.661444  0.277223
3  0.934465  0.279150  0.661444  0.277223
4  0.661444  0.277223  0.739954  0.397264
5  0.661444  0.277223  0.643009  0.283001
6  0.661444  0.277223  0.601368  0.151403

In [18]:
frame3.replace(np.nan,0)

          B         C         B         C
1  0.655049  0.008204  0.000000  0.000000
2  0.932550  0.239121  0.000000  0.000000
3  0.934465  0.279150  0.000000  0.000000
4  0.000000  0.000000  0.739954  0.397264
5  0.000000  0.000000  0.643009  0.283001
6  0.000000  0.000000  0.601368  0.151403

In [19]:
frame3.drop('B',axis=1)

          C         C
1  0.008204       NaN
2  0.239121       NaN
3  0.279150       NaN
4       NaN  0.397264
5       NaN  0.283001
6       NaN  0.151403

In [20]:
dframe = pd.DataFrame({ 'color': ['white','white','red','red','white'],
                     'value': [2,1,3,3,2]})
dframe

   color  value
0  white      2
1  white      1
2    red      3
3    red      3
4  white      2

In [21]:
dframe.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [89]:
dframe[dframe.duplicated()]

   color  value
3    red      3
4  white      2

In [91]:
#Removing duplicates
dframe.drop_duplicates()

   color  value
0  white      2
1  white      1
2    red      3

In [23]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],
                   'color':['white','rosso','verde','black','yellow'],
                 'price':[5.56,4.20,1.30,0.56,2.75]})
frame

      item   color  price
0     ball   white   5.56
1      mug   rosso   4.20
2      pen   verde   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [24]:
newcolors = {
   'rosso': 'red',
   'verde': 'green'
}

In [25]:
frame.replace(newcolors)

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [27]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],
                     'color':['white','red','green','black','yellow']})
frame

      item   color
0     ball   white
1      mug     red
2      pen   green
3   pencil   black
4  ashtray  yellow

In [28]:
prices = {
    'ball' : 5.56,
    'mug' : 4.20,
    'bottle' : 1.30,
    'scissors' : 3.41,
    'pen' : 1.30,
    'pencil' : 0.56,
    'ashtray' : 2.75
}

In [97]:
frame['price'] = frame['item'].map(prices)
frame

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [30]:
nframe = pd.DataFrame(np.arange(25).reshape(5,5))
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [31]:
len(nframe)

5

In [33]:
#Random Sampling
sample = np.random.randint(0, len(nframe), size=3)
sample

array([3, 0, 3])

In [34]:
nframe.take(sample)

    0   1   2   3   4
3  15  16  17  18  19
0   0   1   2   3   4
3  15  16  17  18  19

In [35]:
#The operations of permutation (random reordering)
nframe = pd.DataFrame(np.arange(25).reshape(5,5))
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [37]:
new_order = np.random.permutation(5)
new_order

array([0, 1, 4, 3, 2])

In [38]:
#new_order = [3,4,2]
nframe.take(new_order)

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14

In [104]:
#String Manipulation
text = '16 Bolton Avenue , Boston'
text.split(',')

['16 Bolton Avenue ', ' Boston']

In [105]:
tokens = [s.strip() for s in text.split(',')]
tokens

['16 Bolton Avenue', 'Boston']

In [106]:
address, city = [s.strip() for s in text.split(',')]
print(address)
print(city)

16 Bolton Avenue
Boston

In [108]:
'Boston' in text

True

In [109]:
text.index('Boston')

19

In [110]:
text.find('Boston')

19

In [111]:
text.count('e')

2

In [112]:
text.count('Avenue')

1

In [113]:
text.replace('Avenue','Street')

'16 Bolton Street , Boston'

In [107]:
strings = ['A+','A','A-','B','BB','BBB','C+']
';'.join(strings)

'A+;A;A-;B;BB;BBB;C+'

In [2]:
#Regular Expressions
import re
text = "This is      an\t odd  \n text!"
re.split('\s+', text)

['This', 'is', 'an', 'odd', 'text!']

In [3]:
# find in a string all the words starting with “A” uppercase
text = 'This is my address: 16 Bolton Avenue, Boston'
re.findall('A\w+',text)

['Avenue']

In [4]:
re.findall('[A,a]\w+',text)

['address', 'Avenue']

In [5]:
#While findall() returns all matches within a list, the search() function returns only the first match.
search = re.search('[A,a]\w+',text)
print(search.start())
print(search.end())
print(text[search.start():search.end()])

11
18
address